Autodesk.Revit.DB.WallKind
Describes the fundamental type of wall, such as curtain wall or stacked wall.

Autodesk.Revit.DB.WallKind.Stacked
A stacked wall of several wall types.

Autodesk.Revit.DB.WallKind.Curtain
A curtain wall.

Autodesk.Revit.DB.WallKind.Basic
A standard wall.

Autodesk.Revit.DB.WallKind.Unknown
The basic type is not known.